import type { ChangelogVersion } from "./types";

export const changelog: ChangelogVersion[] = [
	{
		version: "1.0",
		build: 24,
		date: "2025-11-07",
		updates: {
			improvement: [
				"可以设置长按“2X”标识是否显示",
				"优化“2X”标识的位置",
				"优化关注和粉丝页，不再用弹出窗口交互",
			],
			feature: [
				"支持选择默认画质",
				"支持自动选择最高画质",
				"添加一个新的列表布局，参考官方的搜索页",
				"支持删除稍后再看",
			],
			bugfix: [
				"修复了进入视频页时顶部闪烁的问题"
			]
		},
	},
	{
		version: "1.0",
		build: 23,
		date: "2025-11-05",
		updates: {
			improvement: [
				"优化评论展示和交互",
				"优化首页列表加载机制",
				"现在查看评论不会暂停视频播放",
			],
			feature: [
				"支持分享视频",
				"添加新的紧凑型顶部菜单（iOS26）",
			],
			bugfix: [
				"修复了视频页进入和退出一些资源未释放的问题",
				"修复了视频播放页进入UP主空间视频会一直后台播放的问题",
				"修复了点击全屏时，视频先翻转180度再横屏",
				"修复了回复评论的弹窗偶尔白屏的问题",
			]
		},
	},
	{
		version: "1.0",
		build: 22,
		date: "2025-11-04",
		updates: {
			bugfix: [
				"处理点哪儿哪儿就报错的问题",
			]
		},
	},
	{
		version: "1.0",
		build: 21,
		date: "2025-11-04",
		updates: {
			improvement: [
				"视频进入全屏不会暂停播放",
			],
			bugfix: [
				"优化了进入视频详情页的一些逻辑",
				"优化了历史记录同步的一些问题",
			]
		},
	},
	{
		version: "1.0",
		build: 20,
		date: "2025-11-04",
		updates: {
			bugfix: [
				"修复了iOS26.1底部菜单异常显示问题",
			]
		},
	},
	{
		version: "1.0",
		build: 19,
		date: "2025-11-03",
		updates: {
			improvement: [
				"升级了之前的缓存系统",
				"更新首页设置页样式",
			],
			feature: [
				"支持大会员切换画质",
				"添加Apple Music样式的底部菜单（iOS26）",
				"“此版本最低支持iOS17.2，并且在未来会逐步提升支持的系统版本”",
			],
			bugfix: [
				"修复顶部Tab菜单黑暗模式下看不清字的问题",
				"修复了部分机型进入视频详情页会奔溃的问题",
			]
		},
	},
	{
		version: "1.0",
		build: 18,
		date: "2025-10-28",
		updates: {
			bugfix: [
				"处理iOS17、iOS18视频页顶部菜单栏显示的问题。",
			]
		},
	},
	{
		version: "1.0",
		build: 17,
		date: "2025-10-28",
		updates: {
			improvement: [
				"优化首页和动态页顶部交互（iOS26最佳）",
				"iOS17添加一个回到顶部的按钮",
				"iOS18和iOS26可以再次点击底部菜单直接回到顶部",
				"首页、动态页切换Tab将自动回到顶部",
				"视频详情页固定视频播放部分，可以在看视频的时候刷评论",
				"下载管理界面优化",
				"搜索界面去掉自定义的搜索栏，使用弹出式窗口交互",
				"优化动态界面的点赞和评论折行问题",
			],
			feature: [
				"「预告」添加清晰度切换的占位",
				"“根据投票结果，画质切换为大家最关心的功能，下个版本将全力开发此能力”",
			],
			bugfix: [
				"历史记录能够同步播放进度",
				"其他的一些小问题修复",
			]
		},
	},
	{
		version: "1.0",
		build: 15,
		date: "2025-10-24",
		updates: {
			improvement: [
				"iOS26适配，使用全新的底部菜单栏样式，参考App Store的设计",
				"给部分操作添加了弹窗反馈，不会静默失败（未完待续）",
				"用户空间界面可以直接关注，不用再点到视频页面",
			],
			feature: [
				"评论区列表展示、楼中楼展示",
				"评论回复、点赞功能",
				"添加新手指引，防止类似于双列展示的功能被忽略",
			],
			bugfix: [
				"修复了视频详情页无法收藏视频的问题",
				"其他的一些小问题修复",
			]
		},
	},
	{
		version: "1.0",
		build: 14,
		date: "2025-10-20",
		updates: {
			improvement: [
				"MiniBili的观看记录可以同步到官方",
				"重新整理设置界面，去掉占位不能用的设置项",
			],
			feature: [
				"支持设置为隐身模式（不同步观看记录）",
				"支持获取视频合集",
			],
			bugfix: [
				"修复夜间模式个人资料卡片背景色异常问题",
			]
		},
	},
	{
		version: "1.0",
		build: 13,
		date: "2025-10-19",
		updates: {
			feature: [
				"可以查看UP主空间（投稿、动态）",
			],
			bugfix: [
				"修复视频页关注按钮颜色异常问题",
			]
		},
	},
	{
		version: "1.0",
		build: 12,
		date: "2025-10-18",
		updates: {
			improvement: [
				"iPhone和iPad均支持二维码登录",
			]
		},
	},
	{
		version: "1.0",
		build: 11,
		date: "2025-10-17",
		updates: {
			improvement: [
				"支持全球手机号登录",
				"优化首页掉帧问题（未完善）",
			],
			feature: [
				"现在可以关注、取关up",
				"添加黑暗模式的Logo",
				"显示更多缓存管理项",
			]
		},
	},
	{
		version: "1.0",
		build: 10,
		date: "2025-10-16",
		updates: {
			improvement: [
				"个人信息页UI优化",
				"视频详情页UI优化",
			],
			feature: [
				"自定义双列模式下，卡片显示的信息",
				"画中画模式",
				"视频是竖屏，全屏自动竖屏；视频是横屏，全屏自动横屏，此功能在手机设定方向锁定时依旧生效",
			]
		},
	},
	{
		version: "1.0",
		build: 7,
		date: "2025-10-15",
		updates: {
			bugfix: [
				"全屏幕下长按无法2倍速",
				"搜索结果页无法正确显示UP主头像",
			],
			improvement: [
				"部分数据添加缓存",
			],
			feature: [
				"在系统锁定方向的状态下，点击视频全屏，自动横屏播放",
				"可以设置视频列表是单列还是双列",
				"主题设置",
				"视频缓存（游客模式也可以）",
				"缓存视频管理",
			]
		},
	},
	{
		version: "1.0",
		build: 5,
		date: "2025-10-14",
		updates: {
			bugfix: [
				"全屏播放状态异常",
				"视频播放进度条意外重置",
			],
			improvement: [
				"优化了一点弹幕问题",
			],
			feature: [
				"支持长按视频2倍速播放"
			]
		},
	},
	{
		version: "1.0",
		build: 4,
		date: "2025-10-13",
		updates: {
			bugfix: [
				"某些视频播放没有声音",
			],
			feature: [
				"可以在视频详情页点赞"
			]
		},
	},
	{
		version: "1.0",
		build: 3,
		date: "2025-10-12",
		updates: {
			bugfix: [
				"搜索页无法加载视频封面",
				"搜索页返回热门页的逻辑错误",
			],
			improvement: [
				"添加日志记录"
			]
		},
	},
	{
		version: "1.0",
		build: 2,
		date: "2025-10-12",
		title: "🎉 MiniBili 正式发布！感谢大家的支持与期待！",
		updates: {
			feature: [
				"首次发布 - 支持视频播放、搜索、动态、历史记录等核心功能",
				"完美适配 iPhone",
				"深色模式支持，自动跟随系统设置",
			],
		},
	},
];
